МПР/src/InformationRegisters/ДанныеОперацийСБП/ДанныеОперацийСБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеОперацийСБП</name>
  <resources>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТорговаяТочка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>140</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументОперации</name>
    <type>
      <types>DefinedType.ДокументОперацииБИП</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <comment>Идентификатор заказа на оплату в системе СБП</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МПР/src/InformationRegisters/ДанныеОперацийСБП/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Получает исторические данные заказа на оплату по идентификатору.
//
// Параметры
//  Идентификатор - Строка - идентификатор заказа на оплату.
//
// Возвращаемое значение:
//  Структура - данные заказа на оплату:
//    *ДатаОперации - Дата - дата заказа в программе;
//    *СуммаОперации - Число - сумма операции;
//    *НазначениеПлатежа - Строка - назначение для СБП;
//    *ДокументОперации - ОпределяемыйТип.ДокументОперацииБИП - объект оплаты в информационной базе;
//    *ТорговаяТочка - Строка - идентификатор торговой точки для которой была сформирован заказ.
//
Функция ДанныеОперацииСБППоИдентификатору(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеОперацийСБП.ДатаОперации КАК ДатаОперации,
		|	ДанныеОперацийСБП.СуммаОперации КАК СуммаОперации,
		|	ДанныеОперацийСБП.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ДанныеОперацийСБП.ДокументОперации КАК ДокументОперации,
		|	ДанныеОперацийСБП.ТорговаяТочка КАК ТорговаяТочка,
		|	ДанныеОперацийСБП.Оплата КАК Оплата
		|ИЗ
		|	РегистрСведений.ДанныеОперацийСБП КАК ДанныеОперацийСБП
		|ГДЕ
		|	ДанныеОперацийСБП.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("ДатаОперации",      ВыборкаДетальныеЗаписи.ДатаОперации);
		Результат.Вставить("СуммаОперации",     ВыборкаДетальныеЗаписи.СуммаОперации);
		Результат.Вставить("НазначениеПлатежа", ВыборкаДетальныеЗаписи.НазначениеПлатежа);
		Результат.Вставить("ДокументОперации",  ВыборкаДетальныеЗаписи.ДокументОперации);
		Результат.Вставить("ТорговаяТочка",     ВыборкаДетальныеЗаписи.ТорговаяТочка);
		Результат.Вставить("Оплата",            ВыборкаДетальныеЗаписи.Оплата);
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

// Записывает данные оплаты в информационную базу.
//
// Параметры
//  Идентификатор - Строка - идентификатор заказа на оплату;
//  ЗаказНаОплату - Структура - данные заказа на оплату:
//    *ДатаОплаты - Дата - дата заказа в программе;
//    *СуммаОплаты - Число - сумма оплаты;
//    *НазначениеПлатежа - Строка - назначение для СБП;
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииБИП - объект оплаты в информационной базе;
//  ТорговаяТочка - Строка - идентификатор торговой точки для которой была сформирован заказ.
//
Процедура СохранитьДанныеОплаты(
		Идентификатор,
		ЗаказНаОплату,
		ДокументОплаты,
		ТорговаяТочка) Экспорт
	
	Запись = РегистрыСведений.ДанныеОперацийСБП.СоздатьМенеджерЗаписи();
	Запись.Идентификатор     = Идентификатор;
	Запись.ДокументОперации  = ДокументОплаты;
	Запись.ДатаОперации      = ЗаказНаОплату.ДатаОплаты;
	Запись.СуммаОперации     = ЗаказНаОплату.СуммаОплаты;
	Запись.НазначениеПлатежа = ЗаказНаОплату.НазначениеПлатежа;
	Запись.ТорговаяТочка     = ТорговаяТочка;
	Запись.Оплата            = Истина;
	Запись.Записать();
	
КонецПроцедуры

// Записывает данные возврата в информационную базу.
//
// Параметры
//  Идентификатор - Строка - идентификатор заказа на оплату;
//  ЗаказНаВозврат - Структура - данные заказа на возврат:
//    *ДатаВозврата - Дата - дата возврата в программе;
//    *СуммаВозврата - Число - сумма возврата;
//    *НазначениеПлатежа - Строка - назначение для СБП;
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииБИП - объект оплаты в информационной базе;
//  ТорговаяТочка - Строка - идентификатор торговой точки для которой была сформирован заказ.
//
Процедура СохранитьДанныеВозврата(
		Идентификатор,
		ЗаказНаВозврат,
		ДокументВозврата,
		ТорговаяТочка) Экспорт
	
	Запись = РегистрыСведений.ДанныеОперацийСБП.СоздатьМенеджерЗаписи();
	Запись.Идентификатор    = Идентификатор;
	Запись.ДокументОперации = ДокументВозврата;
	Запись.ДатаОперации     = ЗаказНаВозврат.ДатаВозврата;
	Запись.СуммаОперации    = ЗаказНаВозврат.СуммаВозврата;
	Запись.ТорговаяТочка    = ТорговаяТочка;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
